{
    "text":"<p><em><strong>The Most Important Skills to Learn to Advance Your Career and Income:</strong></em></p>    <p>&nbsp;</p>    <p>Nearly everyone wants to earn more money in their careers. Being a Computer Science student, I can&rsquo;t help but notice what&rsquo;s going on with the major across the United States. Right now, there&rsquo;s a large influx of students trying to get into computer science programs. After all, in 2017, it&rsquo;s usually one of the top three highest paid majors upon graduation, and with the increasing demand and salaries of programmers and computer scientists, it follows that students looking for high paying jobs will try to get into their college&rsquo;s computer science programs. After all, a higher paying job and getting access to more opportunities is the reason most people go to college in the first place.</p><p>But is going to college for Computer Science or any other technical major really the best way to maximize income? Sure, studying engineering or computer science may lead to higher paying jobs, but are they the <em>highest </em>paying jobs? Not really. Did people who are incredibly wealthy do so through working as an engineer their whole lives?</p><p>I&rsquo;m highly skeptical that&rsquo;s the case. Yeah, a salary of $100,000 is pretty darn good &ndash; you should have enough to raise a family, own a home, multiple cars, and make sure all your needs are met. With a $100,000 salary, you&rsquo;ll likely be able to save money and invest it too.</p> <p>But realistically, how wealthy are you going to get on a $100,000/year salary? Even if you saved $20,000 a year and invested it at a return of 7%, it would take 23 years of sustaining that savings rate to eventually become a millionaire. All this is assuming a solid 7% return (which isn&rsquo;t always realistic), that there&rsquo;s no major market crashes that wipes out your savings and investments, and that you can <em>actually </em>save $20,000 a year (If you net $100,000, your take home pay in Utah for 2017 would be roughly $68,038, so after you save $20,000 of that, you&rsquo;d be at roughly $48,000 take-home pay.) With $48,000 take home pay, you now have to be a lot more frugal with your expenses than you originally thought. Children are expensive, as are mortgages, automobiles, and insurance for all your toys. Not to mention the price of things like groceries, gasoline, hobbies and vacations.</p> <p>Hopefully now you can see how difficult it actually is to become a millionaire, even if you major in one of the most competitive and highest compensating majors in college.</p>  <p>The point is, it&rsquo;s not enough to just study something that results in a high paying job in college, but there are other more important skills along the way you&rsquo;d want to learn to become wealthy and successful.</p>  <p>Ultimately, ambitious engineers can eventually move into up management in their firms, pushing their paycheck up into the upper 100-200k figures depending on a couple things. But when they do this, they are often using much less technical skills like strategic planning and organization, people management, communication, and other systems-based thinking.</p>  <p>But these aren&rsquo;t the skills necessarily taught in college engineering programs, and are often skills that have to be learned on-the-job and through other life experiences. What are these skills employed by the top income earners?</p> <ul> <li>Relentless organization and planning</li>    <li>Ability to extract and understand information from jargon-heavy and denes documents.</li> <li>Ability to pick up on systems-based models of their business and processes.</li> <li>Ability to communicate complicated ideas, and persuade people to seeing their way of things.</li> <li>The ability to lead and motivate their teammates.</li> <li>The ability for big-picture thinking when it comes to business decisions, operations, and performance.</li> <li>The constant push to improve and learn</li>    </ul> <p>These are the skills that almost all high-income earners must have to be successful and climb the ranks of an organization. If you have these skills along with the technical knowledge from college, you&rsquo;ll be in a great position to eventually move into high-paying jobs and even possibly be successful in starting your own venture, where the money will <em>then really </em>start rolling in.</p> <p>So if you want to maximize your income potential, it&rsquo;s not enough to <em>just </em>choose a technical trade/major, if you really want to differentiate yourself from your peers, you&rsquo;ll want to develop a wide range of skills that you can use to leverage yourself into producing value and increasing your income.</p> <p>Some other important skills are:</p> <ul> <li>The ability to write brief and clear messages</li>   <li>The ability to read and understand complicated material quickly</li>  <li>The ability to build relationships and remain likeable among your peers</li>  <li>The ability to persuade and win people over to your way of thinking with minimal tension in your workplace environment</li>  </ul> <p>If you can develop these skills, I don&rsquo;t believe you even necessarily need a technical major to eventually score a big income, although it would help a lot.</p>",
    
    "author":"Kody C. Kendall",
    
    "date":"October 7, 2017",
    
    "title":"The Most Important Skills to Learn to Advance Your Career and Income",
    
    "imagePath":"img/careeradvancement.jpeg",
    
    "subtitle":""

}